RANS/kEps/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    down
    {
        type            symmetry;
    }

    right
    {
        type            zeroGradient;
    }

    up
    {
        type            symmetry;
    }

    left
    {
        type            fixedValue;
        value           $internalField;
    }

    cylinder
    {
        type            fixedValue;
        value           $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
